# <font color="blue">Goals: </font>
<ol>
    <li>Break out dates into year, month, and day</li>
    <li>Break a date into other component parts</li>
</ol>

# Import Dependencies

In [1]:
from sqlalchemy import create_engine
import pandas as pd
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)

In [2]:
# Connect to sqlite database
engine = create_engine('mysql+pymysql://xxx:xxx@xxxx/calendar', pool_recycle=3600)
conn = engine.connect()

In [3]:
# Confirm connection by printing tables
engine.table_names()

['calendartable']

<hr style="border-top: 2px solid black;">

# Examine Data

In [4]:
# View a few instances of the data
sql_view_data = "SELECT * FROM calendartable LIMIT 3;"

In [5]:
# Run query
data_view = pd.read_sql(sql_view_data, conn)
# Displaying data
data_view

,DateKey,Date,Day,DayOfWeek,DayName,IsWeekend,DayOfWeekInMonth,CalendarDayOfYear,WeekOfMonth,CalendarWeekOfYear,CalendarMonth,MonthName,CalendarQuarter,CalendarQuarterName,CalendarYear,FirstDayOfMonth,LastDayOfMonth,FirstDayOfWeek,LastDayOfWeek,FirstDayOfQuarter,LastDayOfQuarter,CalendarFirstDayOfYear,CalendarLastDayOfYear,FirstDayOfNextMonth,CalendarFirstDayOfNextYear,FiscalDayOfYear,FiscalWeekOfYear,FiscalMonth,FiscalQuarter,FiscalQuarterName,FiscalYear,FiscalFirstDayOfYear,FiscalLastDayOfYear,FiscalFirstDayOfNextYear
0,20000101,2000-01-01,1,7,Saturday,1,1,1,1,1,1,January,1,Q1,2000,2000-01-01,2000-01-31,2000-01-01,2000-01-01,2000-01-01,2000-03-31,2000-01-01,2000-12-31,2000-02-01,2001-01-01,185,27,7,3,Q3,1999,1999-07-01,2000-06-30,2000-07-01
1,20000102,2000-01-02,2,1,Sunday,1,1,2,2,2,1,January,1,Q1,2000,2000-01-01,2000-01-31,2000-01-02,2000-01-08,2000-01-01,2000-03-31,2000-01-01,2000-12-31,2000-02-01,2001-01-01,186,28,7,3,Q3,1999,1999-07-01,2000-06-30,2000-07-01
2,20000103,2000-01-03,3,2,Monday,0,1,3,2,2,1,January,1,Q1,2000,2000-01-01,2000-01-31,2000-01-02,2000-01-08,2000-01-01,2000-03-31,2000-01-01,2000-12-31,2000-02-01,2001-01-01,187,28,7,3,Q3,1999,1999-07-01,2000-06-30,2000-07-01

<hr style="border-top: 2px solid black;">

# Break out the year, month, and day from a date

The following functions extract parts of a date:
 - <code>YEAR()</code>: returns the year for a given date.
 - <code>MONTH()</code>: returns the month for the date within a range of 1 to 12 ( January to December).
 - <code>DAY()</code>: returns the day of the month for a specified date.

In [6]:
sql_expample_1 = """
SELECT
CURDATE() AS CurrentDate,
YEAR(CURDATE()) AS TheYear,
MONTH(CURDATE()) AS TheMonth,
DAY(CURDATE()) AS TheDay;"""

In [7]:
# Run query
view = pd.read_sql(sql_expample_1, conn)
# Displaying data
view.head()

  CurrentDate  TheYear  TheMonth  TheDay
0  2020-04-16     2020         4      16

<hr style="border-style: 3px dotted;">

# Break out the year, month, and day from a date column in an SQL Table
<br>
<code>SELECT YEAR(Date) AS Year_method, MONTH(Date) AS Month_method, DAY(Date) AS Day_method
FROM table;</code>

In [8]:
sql_example2 = """
SELECT Date, YEAR(Date) AS Year_method, MONTH(Date) AS Month_method, DAY(Date) AS Day_method
FROM calendartable
LIMIT 5
;"""

In [9]:
# Run query
view = pd.read_sql(sql_example2, conn)
# Displaying data
view.head()

         Date  Year_method  Month_method  Day_method
0  2000-01-01         2000             1           1
1  2000-01-02         2000             1           2
2  2000-01-03         2000             1           3
3  2000-01-04         2000             1           4
4  2000-01-05         2000             1           5

<hr style="border-top: 2px solid black;">

# Break a date and time into component parts using <code>DATE_FORMAT('date', format)</code>

 - <code>YEAR()</code>, <code>MONTH()</code>, and <code>DAY()</code> are helpful but often we will need to break a date into other components, such as:<br><br>
 
 <ul>
    <li>Name of Day: <code>DATE_FORMAT('date', '%%W')</code></li>      
    <li>Day of the week: <code>DATE_FORMAT('date', '%%w')</code></li>
    <li>The Month: <code>DATE_FORMAT('date', '%%M')</code></li>
    <li>The Week of the Year: <code>DATE_FORMAT('date', '%%u')</code> </li>
    <li>The Year of the Week: <code>DATE_FORMAT('date', '%%u')</code></li>
</ul>

In [10]:
sql_example3 = """
SELECT STR_TO_DATE('2020-08-06 05:17:36','%%Y-%%m-%%d %%H:%%i:%%s') AS Mars_landing,
DATE_FORMAT('2020-08-06 05:17:36', '%%W') AS TheDayName,
DATE_FORMAT('2020-08-06 05:17:36', '%%w') AS TheDayofWeek,
DATE_FORMAT('2020-08-06 05:17:36', '%%M') AS TheMonth,
DATE_FORMAT('2020-08-06 05:17:36', '%%u') AS TheWeekofYear,
DATE_FORMAT('2020-08-06 05:17:36', '%%x') AS TheYearforWeek
;"""

In [11]:
# Run query
view = pd.read_sql(sql_example3, conn)
# Displaying data
view.head()

,Mars_landing,TheDayName,TheDayofWeek,TheMonth,TheWeekofYear,TheYearforWeek
0,2020-08-06 05:17:36,Thursday,4,August,32,2020

<hr style="border-style: 3px dotted;">

# Break out the year, month, and day from a date column in an SQL Table using <code>DATE_FORMAT()</code>
<br>
<code>SELECT Date, DATE_FORMAT(Date, '%%W') AS TheDayName, 
DATE_FORMAT(Date, '%%w') AS TheDayofWeek, 
DATE_FORMAT(Date, '%%M') AS TheMonth, 
DATE_FORMAT(Date, '%%u') AS TheWeekofYear,
DATE_FORMAT(Date, '%%x') AS TheYearforWeek
FROM table LIMIT 5;</code>

In [12]:
sql_example4 = """
SELECT Date, 
DATE_FORMAT(Date, '%%W') AS TheDayName, 
DATE_FORMAT(Date, '%%w') AS TheDayofWeek, 
DATE_FORMAT(Date, '%%M') AS TheMonth, 
DATE_FORMAT(Date, '%%u') AS TheWeekofYear,
DATE_FORMAT(Date, '%%x') AS TheYearforWeek
FROM calendartable LIMIT 5;
;"""

In [13]:
# Run query
view = pd.read_sql(sql_example4, conn)
# Displaying data
view.head()

         Date TheDayName TheDayofWeek TheMonth TheWeekofYear TheYearforWeek
0  2000-01-01   Saturday            6  January            00           1999
1  2000-01-02     Sunday            0  January            00           1999
2  2000-01-03     Monday            1  January            01           2000
3  2000-01-04    Tuesday            2  January            01           2000
4  2000-01-05  Wednesday            3  January            01           2000

<hr style="border-top: 2px solid black;">

# Break a date and time into component parts using <code>DAY__()</code> functions
 
 <ul>
    <li>Name of Day: <code>DAYNAME(date)</code></li>      
    <li>Day of the week: <code>DAYOFWEEK(date)</code></li>
    <li>The Month: <code>DAYOFMONTH(date)</code></li>
    <li>The Day of the Year: <code>DAYOFYEAR(date)</code> </li>
</ul>

In [14]:
sql_example5 = """
SELECT STR_TO_DATE('2020-08-06 05:17:36','%%Y-%%m-%%d %%H:%%i:%%s') AS Mars_landing,
DAYNAME('2020-08-06 05:17:36') AS TheDay,
DAYOFWEEK('2020-08-06 05:17:36') AS TheWeek,
DAYOFMONTH('2020-08-06 05:17:36') AS TheMonth,
DAYOFYEAR('2020-08-06 05:17:36') AS TheYear
;"""

In [15]:
# Run query
view = pd.read_sql(sql_example5, conn)
# Displaying data
view.head()

         Mars_landing    TheDay  TheWeek  TheMonth  TheYear
0 2020-08-06 05:17:36  Thursday        5         6      219

<hr style="border-style: 3px dotted;">

# Break a date and time into component parts using <code>DAY__()</code> functions on a date column in an SQL Table
 
<code>SELECT Date ,
DAYNAME(Date) AS TheDay,
DAYOFWEEK(Date) AS TheWeek,
DAYOFMONTH(Date) AS TheMonth,
DAYOFYEAR(Date) AS TheYear
FROM calendartable
LIMIT 5;</code>

In [16]:
sql_example6 = """
SELECT Date ,
DAYNAME(Date) AS TheDay,
DAYOFWEEK(Date) AS TheWeek,
DAYOFMONTH(Date) AS TheMonth,
DAYOFYEAR(Date) AS TheYear
FROM calendartable
LIMIT 5;"""

In [17]:
# Run query
view = pd.read_sql(sql_example6, conn)
# Displaying data
view.head()

         Date     TheDay  TheWeek  TheMonth  TheYear
0  2000-01-01   Saturday        7         1        1
1  2000-01-02     Sunday        1         2        2
2  2000-01-03     Monday        2         3        3
3  2000-01-04    Tuesday        3         4        4
4  2000-01-05  Wednesday        4         5        5

<hr style="border-top: 2px solid black;">

# Break a date and time into component parts using <code>EXTRACT(unit FROM date)</code> functions
 
 - 'Unit' Relies on temporal interval
 - Temporal Interval Documentation: https://dev.mysql.com/doc/refman/8.0/en/expressions.html#temporal-intervals
 
 <ul>
    <li>Year: <code>EXTRACT(YEAR FROM 'date')</code></li>      
    <li>Year Month (YEARS-MONTHS): <code>EXTRACT(YEAR_MONTH FROM 'date')</code></li>
    <li>Day: <code>EXTRACT(DAY FROM 'date')</code></li>
    <li>Quarter: <code>EXTRACT(QUARTER FROM 'date')</code></li>
    <li>Day Minutes (HOURS:MINUTES): <code>EXTRACT(DAY_MINUTE FROM 'date')</code></li>
</ul>

In [18]:
sql_example7 = """
SELECT STR_TO_DATE('2020-08-06 05:17:36','%%Y-%%m-%%d %%H:%%i:%%s') AS Mars_landing,
EXTRACT(YEAR FROM '2020-08-06 05:17:36') AS Year,
EXTRACT(YEAR_MONTH FROM '2020-08-06 05:17:36') AS YearMonth,
EXTRACT(DAY FROM'2020-08-06 05:17:36') AS Day,
EXTRACT(QUARTER FROM '2020-08-06 05:17:36') AS Quarter,
EXTRACT(DAY_MINUTE FROM '2020-08-06 05:17:36') AS DayMinutes
;"""

In [19]:
# Run query
view = pd.read_sql(sql_example7, conn)
# Displaying data
view.head()

         Mars_landing  Year  YearMonth  Day  Quarter  DayMinutes
0 2020-08-06 05:17:36  2020     202008    6        3       60517

<hr style="border-style: 3px dotted;">

# Extract Date Parts From Attribute in SQL Table using <code>EXTRACT(UNIT, DATE)</code> function

In [20]:
sql_example8 = """
SELECT Date,
EXTRACT(YEAR FROM Date) AS Year,
EXTRACT(YEAR_MONTH FROM Date) AS YearMonth,
EXTRACT(DAY FROM Date) AS Day,
EXTRACT(QUARTER FROM Date) AS Quarter
FROM calendartable
LIMIT 5;"""

In [21]:
# Run query
view = pd.read_sql(sql_example8, conn)
# Displaying data
view.head()

         Date  Year  YearMonth  Day  Quarter
0  2000-01-01  2000     200001    1        1
1  2000-01-02  2000     200001    2        1
2  2000-01-03  2000     200001    3        1
3  2000-01-04  2000     200001    4        1
4  2000-01-05  2000     200001    5        1